app/controllers/commits_controller.rb

  def index
    @release = Release.find(params[:release_id], :include => :commits)
---
SELECT * FROM "commits" WHERE ("commits".release_id = 4) AND (status in ('blocked','goes_in'))
SELECT * FROM "releases" WHERE ("releases"."id" = 4)

  def show
    @commit = Commit.find(params[:id])
---
SELECT * FROM "commits" WHERE ("commits"."id" = 953125641)

  def update
    @commit = Commit.find(params[:id])

    respond_to do |format|
      if @commit.update_attributes(params[:commit])
---
SELECT * FROM "commits" WHERE ("commits".release_id = 4) AND (status in ('blocked','goes_in'))
UPDATE "commits" SET "testing_text" = 'r11857 Membership requires regression testing. (test everything around the ''membership'' functionallity)', "updated_at" = '2009-01-26 11:08:24' WHERE "id" = 166

  def destroy
    @commit = @release.commits.find(params[:id])
---
SELECT * FROM "commits" WHERE ("commits"."id" = 953125641)