app/controllers/releases_controller.rb

SELECT * FROM "releases" WHERE ("releases"."id" = 1)
SELECT * FROM "commits" WHERE ("commits".release_id = 1 AND (status = 'goes_in'))
---
  def show
    @release = Release.find(params[:id])
    @goes_in = @release.commits.find(:all, :conditions => "status = 'goes_in'" )

SELECT * FROM "releases" WHERE ("releases"."id" = 7)
---
  def edit
    @release = Release.find(params[:id])

SELECT * FROM "commits" WHERE ("commits".release_id = 4) AND (status = 'goes_in')
SELECT * FROM "releases" WHERE ("releases"."id" = 4)
---
  def svn_commands
    @release = Release.find(params[:id], :include => :commits);

INSERT INTO "releases" ("name", "updated_at", "comments", "testing_text", "changes_text", "created_at") VALUES('Test release', '2009-01-26 10:53:45', 'i am testing this version works.', NULL, NULL, '2009-01-26 10:53:45')
---
  def create
    @release = Release.new(params[:release])

    respond_to do |format|
      if @release.save

SELECT * FROM "releases" WHERE ("releases"."id" = 1)
---
  def update
    @release = Release.find(params[:id])

SELECT * FROM "releases" WHERE ("releases"."id" = 5)
DELETE FROM "releases" WHERE "id" = 5
---
  def destroy
    @release = Release.find(params[:id])
    @release.destroy